Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Secretary Out-of-Order.tmx
Source language: en
Languages: es_419

source: but all her talk of marriage was getting to me...
es_419: Pero tanto hablar de casarme ya me molesta…

source: but I didn't break your arm...
es_419: Pero no le quebré el brazo…

source: documents must be printed out only at iren for security issues!
es_419: ¡Por seguridad, los documentos solo se pueden imprimir en IREN!

source: this might sting a bit.
es_419: Quizás te arda un poco.

source: is that your usual bedtime?
es_419: ¿Siempre te acuestas a esa hora?

source: it wouldn't be so bad if he spoke a little nicer.
es_419: Si fuera un poquito más amable, no sería tan terrible.

source: pft
es_419: pff

source: no way...
es_419: No puede ser…

source: freeze
es_419: QUIETO

source: by the way, where's ms. gam?
es_419: ¿Y dónde está la señorita Gam?

source: I get to eat your food?
es_419: ¿Podré comer tu comida?

source: one middle-aged couple and their daughter were in the vehicle.
es_419: En él viajaba un matrimonio con su hija.

source: y-you're welcome…
es_419: D-de nada…

source: is that why everyone gets married?
es_419: ¿Para eso se casa todo el mundo?

source: are you listening?
es_419: ¿Me estás oyendo?

source: you'll have a lot of free time once you quit...
es_419: Cuando renuncies tendrás mucho tiempo libre…

source: hehe.
es_419: JEJE

source: first time he made a typo!
es_419: ¡Primera vez que escribe mal!

source: For example, the first chapter, gives attention to a broken child.
es_419: Por ejemplo, dedica el primer capítulo a los niños descarriados.

source: nothing much otherwise...
es_419: No mucho más que eso…

source: I want to eat something salty after all the crying.
es_419: Con tanto llanto, ahora quiero comer algo salado.

source: yes, this is a sign of her breaking down!
es_419: Sí, ¡es una señal de que se está descarriando!

source: ...not choi.
es_419: … no Choi.

source: …and came back to korea after my mom passed away in an accident.
es_419: … y que volví a Corea cuando mi mamá falleció en un accidente.

source: -Write down your name and exam number in the corresponding column of the exam sheet
es_419: -Escriba su nombre y número de examen en la columna correspondiente de la hoja de examen.

source: - episode 09 -
es_419: - episodio 09 -

source: not that!
es_419: ¡Eso no!

source: …my body?
es_419: … mi cuerpo?

source: I'm so moved…
es_419: Estoy conmovida…

source: Right?
es_419: ¿Cierto?

source: it's about ms. gam, isn't it?
es_419: ¿Pasa algo con la señorita Gam?

source: I was going to ask her to get something to eat together, but...
es_419: Iba a proponerle que fuéramos a comer algo juntos, pero…

source: that jerk is coming back to korea.
es_419: Ese idiota va a volver a Corea.

source: I'm dohyeok chae, ceo of iren.
es_419: Soy Dohyeok Chae, CEO de IREN.

source: He's going to give me an earful for bothering him
es_419: Me va a dar un sermón por molestarlo

source: I messed it all up!
es_419: ¡Arruiné todo!

source: I can't believe someone like you has someone like that as a parent...
es_419: No puedo creer que alguien como tú tenga un padre como él…

source: d-did he hear that?
es_419: ¿M-me habrá oído?

source: come closer.
es_419: Acércate.

source: you need to hide!
es_419: ¡Escóndete!

source: it was like my farewell party towards the end.
es_419: Al final parecía más mi fiesta de despedida.

source: was directing the water over a cliff at the end.
es_419: iba directo hacia un precipicio.

source: *about 1 USD
es_419: *MÁS O MENOS USD 1.

source: Did something good happen?
es_419: ¿Pasó algo bueno?

source: I see!
es_419: ¡Entiendo!

source: wow... can't believe there's someone like that at iren.
es_419: Guau… Increíble que haya alguien así en IREN.

source: oh, by courier? sure.
es_419: Ah, ¿por mensajería? Sí.

source: but their daughter miraculously survived.
es_419: Pero la hija se salvó de milagro.

source: anyway, life is about timing. we're too old to be reckless.
es_419: Lo que importa es el momento. Estamos grandes para ser imprudentes.

source: I was stunned by his shocking proposal, but...
es_419: Me dejó perpleja su impactante propuesta, pero...

source: look here, sir.
es_419: A ver, señor.

source: I want to see!
es_419: ¡Quiero ver!

source: then gradually work your way into the extreme.
es_419: Luego avanzas de a poco hasta el extremo.

source: this place looks much smaller with dohyeok.
es_419: Parece mucho más pequeño con él dentro.

source: oh, about this week's schedule--
es_419: Ah, en la agenda de esta semana…

source: see ya!
es_419: nos vimos!

source: oh… haha…
es_419: Ah… Ja, ja…

source: take care, yu-eun! keep up the good work!
es_419: ¡Cuídate, Yu-eun! ¡Sigue así!

source: you're the problem!
es_419: ¡El problema es usted!

source: oh dear... that must've hurt a lot.
es_419: Ay, cielos… Te habrá dolido mucho.

source: she blacked out after the kiss.
es_419: Se petrificó después del beso.

source: oh, he's on the phone.
es_419: Ah, está al teléfono.

source: did you see that? isn't that ms. gam?
es_419: ¿Viste eso? ¿No es la señorita Gam?

source: I wonder if she has a boyfriend...
es_419: ¿Tendrá novio?…

source: it won't be any good if I didn't make use of my free time.
es_419: Si no aprovecho mi tiempo libre, no servirá de nada.

source: sorry, girls.
es_419: Perdón, chicas.

source: he'll pay for this!
es_419: ¡Me las va a pagar!

source: I have no business being here!
es_419: ¡No tengo nada que hacer aquí!

source: hmmm.
es_419: Mmm.

source: you're late.
es_419: Llegas tarde.

source: fortunately, ms. gam was there and she called an ambulance.
es_419: Por suerte, la señorita Gam estaba ahí, y llamó a la ambulancia.

source: it's fine. it was your first blind date. it's okay to mess up.
es_419: Está bien. Fue tu primera cita a ciegas. No pasa nada si la arruinas.

source: take care!
es_419: ¡Cuídese!

source: how can I believe that?!
es_419: ¡¿Debería creerte?!

source: you've come a long way, aiden.
es_419: Has evolucionado mucho, Aiden.

source: but now, ms. gam…
es_419: Pero ahora…

source: I'll close it all pretty for you!
es_419: ¡Yo mismo te lo arreglo!

source: ummm...
es_419: Eeem…

source: that, or he was just a hermit.
es_419: O que era un ermitaño no más.

source: it took a lot of effort to be tardy.
es_419: Me esforcé mucho por llegar tarde.

source: auction bid strategy
es_419: Estrategias para subastas

source: t-thank you.
es_419: G-gracias.

source: good morning, mr.
es_419: Buen día, señor

source: I'll see you later!
es_419: ¡Nos vemos luego!

source: it said that the ceo here was no joke.
es_419: Decía que el CEO era cosa seria.

source: This will be my schedule...
es_419: Este será mi cronograma…

source: - episode 26 -
es_419: - episodio 26 -

source: why…
es_419: ¿Por qué…

source: but there's still...
es_419: Pero aún hay…

source: press
es_419: PRESIONA

source: it's on me.
es_419: Yo invito.

source: *about 1.3 million usd
es_419: * MÁS O MENOS 1,3 MILLONES DE USD.

source: was the blind date that bad?
es_419: ¿Tan mal estuvo la cita a ciegas?

source: or maybe this job wasn't for me from the start.
es_419: O quizás nunca fui ideal para este trabajo.

source: what was I thinking?
es_419: ¿Cómo se me ocurre?

source: yu-eun, I'll be right back after I lock him up somewhere.
es_419: Ya vuelvo, Yu-eun. Iré a encerrarlo en algún lado.

source: while you feel guilty.
es_419: si te sientes culpable.

source: is it something for me to review?
es_419: ¿Es algo que debo revisar?

source: 24 hours was not enough to carry out his terrifying schedule...
es_419: Con 24 horas no me alcanzaba para cumplir con su espantosa agenda…

source: Because I'm just as guilty as you are.
es_419: Porque soy tan culpable como tú.

source: ...and my efforts to appear normal piled up...
es_419: … con mi esfuerzo por parecer normal…

source: lost
es_419: PERDIÓ

source: you know, her parents…
es_419: ¿Sabías? Sus padres…

source: again, I apologize for causing you trouble last night!
es_419: ¡Me disculpo de nuevo por causarle problemas anoche!

source: a smile
es_419: A SONREÍR

source: wait, but isn't he married?!
es_419: Pero ¡¿no estaba casado?!

source: I already declared my resignation.
es_419: Ya presenté mi renuncia.

source: that's not something you say to a supervisor during lunch!!
es_419: ¡No se le dice eso a un superior en un almuerzo!

source: did you just say we?! oh, my!
es_419: ¡¿Dijiste "debemos"?! ¡Vaya!

source: an absolute sucker for praise!
es_419: ¡Loca total por los halagos!

source: yu-eun, you can do this!
es_419: ¡Tú puedes, Yu-eun!

source: ...after going back and forth between these three places?
es_419: … si iba y venía todo el tiempo entre los tres lugares?

source: inseo kang (experienced secretary)
es_419: Inseo Kang (secretaria con experiencia)

source: I can't wait to jump into bed after a hot shower!
es_419: ¡No veo la hora de una ducha caliente e ir a la camita!

source: I read books.
es_419: Leo libros.

source: I'm only 28.
es_419: Tengo solo 28 años.

source: I'm sorry for making you uncomfortable.
es_419: Lamento haberte incomodado.

source: That made me anxious and I started feeling pathetic.
es_419: Eso me angustió, y empecé a sentirme patética.

source: you should have corrected me.
es_419: Me deberías haber corregido.

source: sit
es_419: se incorpora

source: auntie will worry if she sees this arm.
es_419: Si la tía me ve el brazo, se va a preocupar.

source: it was my dad's decision.
es_419: Por decisión de mi papá.

source: I'm bound to fail.
es_419: Voy a fracasar.

source: I have to resign!
es_419: ¡Tengo que renunciar!

source: Guess so. it's finally hit me.
es_419: Eso creo. Al fin me doy cuenta.

source: haha. are you still asleep?
es_419: Ja, ja. ¿Sigues dormida?

source: come to think of it, he's never once mentioned his family.
es_419: Ahora que lo pienso, él no ha mencionado su familia ni una vez.

source: hot body!
es_419: ¡Cuerpazo!

source: the accident took place on the road in the suburbs.
es_419: El accidente ocurrió en una calle de los suburbios.

source: It was Gam something.
es_419: Gam o algo así.

source: this one is my fault.
es_419: Eso es mi culpa.

source: I'm a secretary at iren.
es_419: Soy secretaria en IREN.

source: thunk!
es_419: ¡PUM!

source: I take it because I'm nice, but don't be like that to other people.
es_419: Te lo acepto porque soy simpático, pero no trates así a los demás.

source: big
es_419: ¡GRAN

source: dohyeok! you have to go to work tomorrow!
es_419: ¡Dohyeok, tienes que trabajar mañana!

source: I'm shocked at myself, actually.
es_419: La verdad, me sorprendo de mí misma.

source: I'll be publicly shamed.
es_419: Será una humillación pública.

source: that you had a lot of work-related stress... and that you've lost your passion for work.
es_419: Que estabas muy estresada por el trabajo… Y que ya no tenías entusiasmo por el empleo.

source: any other day, he would have been like this...
es_419: En cualquier otro momento, me habría dicho esto:

source: ...about that hangover of yours?
es_419: … con esa resaca que tienes.

source: at first, i enjoyed being called diligent, trustworthy, and mature.
es_419: Al principio, me gustaba que me consideraran diligente, confiable y madura.

source: going for an engagement free pass!
es_419: ¡Quiere luz verde para ir en serio!

source: it's a battle of wills
es_419: Es una batalla de egos

source: why do you suddenly want to know which restaurants are quiet enough for two people to have a conversation?
es_419: Por qué de repente quieres saber qué restaurantes son tranquilos para que dos personas puedan conversar?

source: it's obvious, isn't it?
es_419: Es obvio, ¿no crees?

source: because you worked for me.
es_419: Porque trabajaste para mí.

source: glug
es_419: glu

source: I can't take it anymore!
es_419: ¡No lo soporto más!

source: …and how different…
es_419: … y qué diferentes…

source: going on a blind date a week before leaving iren…
es_419: Ir a una cita a ciegas una semana antes de dejar IREN…

source: I won't...
es_419: No lo haré…

source: but for now, I don't have any requests.
es_419: Pero por ahora no quiero nada en especial.

source: what he meant when he said we were alike.
es_419: qué quiso decir con eso de que somos parecidos.

source: if it's your concern is about your salary... feel free to tell me.
es_419: Si lo que te preocupa es el sueldo… siéntete libre de decirme.

source: yes, I fell.
es_419: Sí, me caí.

source: oh, um... sure! why not?
es_419: Ah, eh… ¡Claro! Qué más da.

source: I really do not understand the human body.
es_419: No comprendo para nada al cuerpo humano.

source: then a week will pass, then a month, then a quarter...
es_419: Y pasará una semana, luego un mes, luego un trimestre…

source: what's going on? why are you doing this to me, sir?
es_419: ¿Qué me pasa? ¿Por qué me está haciendo esto, señor?

source: yes! make it quick, please.
es_419: ¡Sí! Rápido, por favor.

source: I was obsessed with meals that I made myself.
es_419: Me obsesioné con la comida que me preparaba.

source: I like you better when you don't work.
es_419: Me caes mejor cuando no trabajas.

source: so that's why his meetings with clients were short!
es_419: ¡Por eso las reuniones con sus clientes eran cortas!

source: she did say she'd visit last time.
es_419: La otra vez me dijo que vendría.

source: I'm finally late.
es_419: Al fin llego tarde.

source: son-in-law
es_419: cotizado

source: I kicked myself all night and then I called you when I woke up...
es_419: Me torturé toda la noche y te llamé apenas me desperté.

source: They should know better.
es_419: Deberían ubicarse.

source: broadly speaking, perhaps you want to prepare for retirement or marriage? or maybe even something small as buying a car?
es_419: En líneas generales, quizás quiera prepararse para retirarse o casarse. O quizás algo sencillo, como comprar un auto.

source: everyone says he's a monk…
es_419: Dicen que es un monje…

source: HIGH GOOD HIGH GOOD
es_419: ALTO BUENO ALTO BUENO

source: The cast has arrived!
es_419: ¡Ya llegó el elenco!

source: …kiss you.
es_419: … besarte.

source: I may face things that only happen to main characters of k-dramas.
es_419: Quizás pase por los dramas típicos de las protagonistas de las novelas.

source: Please, relax. it's your home.
es_419: Tranquila, en serio. Es tu casa.

source: grunt
es_419: nnjjj

source: did they confirm her identity?!
es_419: ¡¿Confirmaron su identidad?!

source: retreat for now...
es_419: retiraré por ahora…

source: But only if you promise me you'll do the same.
es_419: Pero solo si me prometes lo mismo a mí.

source: I brought your coffee, sir.
es_419: Le traje el café, señor.

source: it's okay!
es_419: Está bien!

source: ugh. why you...
es_419: Uff. ¿Qué te…?

source: 24 hours is not enough, let‘s have a look at his day! what he does during his meal time alone
es_419: Con 24 horas no alcanza, ¡conoce cómo es su día a día! Qué hace mientras come a solas.

source: I heard she's leaving iren soon.
es_419: Oí que se irá de IREN pronto.

source: oh?
es_419: ¿Eh?

source: icy
es_419: GLACIAL

source: ...I've got all the time in the world!
es_419: ¡Tengo todo el tiempo del mundo!

source: it looks good on you, miss.
es_419: Le queda muy bien, señorita.

source: I had to learn all sorts of things like paying off my debt and insurance fees as soon as I left the hospital.
es_419: Apenas salí del hospital, tuve que aprender todo, como pagar la deuda y los costos del seguro.

source: work life balance?
es_419: ¿Equilibrio laboral?

source: I wanted to see you make that face whenever I could.
es_419: Quería verte poner esa cara en todo momento.

source: What are you doing here?
es_419: ¿Qué hace aquí?

source: I'll be fine in a day--
es_419: Me sentiré mejor maña…

source: I guess I should take it.
es_419: Mejor se lo acepto.

source: oh my!
es_419: ¡Cielos!

source: I'm not as free-spirited as you are.
es_419: que yo no soy tan liberal como tú.

source: to spite you.
es_419: por rencor.

source: stock firm analyst
es_419: análisis de financieras

source: for inquiries call
es_419: por consultas, llame al

source: I can't find the armhole!
es_419: ¡No encuentro el brazo!

source: "chapter one,
es_419: "Capítulo uno:

source: ahh! so cool!
es_419: ¡Aah! ¡Qué grande!

source: why on earth did he have to...
es_419: ¿Por qué cuernos tenía que…

source: I'm sort of like a parent to her. you can say I raised her.
es_419: Soy como su madre, se puede decir que yo la crie.

source: it must be difficult dealing with executives all the time.
es_419: Debe ser difícil lidiar con altos rangos todo el tiempo.

source: yes, please.
es_419: Sí, por favor.

source: …yes, that's right.
es_419: Sí, es cierto.

source: I'm not ready yet!
es_419: ¡No estoy lista!

source: did you mean right now?
es_419: ¿Ahora mismo, dice?

source: …be okay like this?
es_419: … le parecerá bien?

source: ...why don't you stay for dinner?
es_419: ¿Por qué no te quedas a cenar?

source: making plans solely for myself with nothing set.
es_419: Hacer planes solo para mí, sin nada decidido.

source: that's so you, though...
es_419: Aunque no me extraña de ti.

source: right-at-home
es_419: como en casa

source: I'll ask hyorin to check right now.
es_419: Le pediré a Hyorin que lo busque.

source: maybe...
es_419: Tal vez…

source: how about real estate?
es_419: ¿Y alguna propiedad?

source: let's start with this area.
es_419: Empecemos por aquí.

source: observe?
es_419: ¿Observarlo?

source: I guess you can't expect much from those arranged by our moms.
es_419: Supongo que no se puede esperar mucho si la coordina una mamá.

source: I'm... quitting!
es_419: ¡Voy a… renunciar!

source: ...a child out-of-order?
es_419: … a un niño descarriado?

source: …that?
es_419: … eso?

source: perhaps...
es_419: ¿Será que…?

source: I think I drank too much beer.
es_419: Creo que bebí demasiada cerveza.

source: th-that's true, but...
es_419: E-es cierto, pero…

source: h-he's really fast…
es_419: E-es muy veloz…

source: see 48 more comments
es_419: Ver 48 comentarios más

source: daddy?
es_419: ¿Papi?

source: our first time grabbing drinks together...
es_419: La primera vez que salimos juntos por tragos…

source: it's like I forgot something important…
es_419: Como que me olvidé de algo importante…

source: oh, no. I blurted it out without realizing.
es_419: Ay, no. Lo solté sin pensar.

source: don't worry about it. it's nothing compared to what you're going through because of me.
es_419: Descuide. No es nada, comparado con lo que usted está pasando por mi culpa.

source: since you're busy…
es_419: estás ocupado…

source: I'm very sorry... about your arm.
es_419: Lamento mucho… lo de su brazo.

source: what happened was...
es_419: Lo que pasó es que…

source: you're always so careful.
es_419: Siempre tienes mucho cuidado.

source: let's be…
es_419: Seamos…

source: I'm fine sitting on the floor.
es_419: No me molesta sentarme en el piso.

source: I'll just come clean!
es_419: ¡Diré la verdad y ya!

source: I don't have one.
es_419: No tengo un hijo.

source: this!
es_419: ¡Esto!

source: I-I understand!
es_419: ¡L-lo entiendo!

source: he's clean cut and polite.
es_419: Es limpio y amable.

source: I'll go directly to hr.
es_419: Iré a recursos humanos.

source: wh-what are you doing here?
es_419: ¿Qué… hace usted aquí?

source: how can I when my bachelor friend might have a child?!
es_419: Imposible. ¡Mi amigo soltero quizás tenga un hijo!

source: …let's stay in touch.
es_419: … no dejemos de hablar.

source: how could I say something like that and not even remember?!
es_419: ¡¿Cómo pude haber dicho algo así, y ni siquiera acordarme?!

source: her rebellion is slowly making progress.
es_419: Su rebelión avanza de a poco.

source: I'm a permanent fixture.
es_419: Soy un adorno permanente.

source: well, then…
es_419: Muy bien…

source: stop here.
es_419: Frena aquí.

source: don't you have a meeting today? do you have time to come this far?
es_419: ¿No tienes una reunión hoy? ¿Tienes tiempo para venir hasta aquí?

source: oh my gosh…
es_419: Madre de dios…

source: adjust
es_419: ACOMODA

source: she's here.
es_419: Llegó.

source: it's just that…
es_419: Es que…

source: there’ll be a report on it this afternoon.
es_419: Esta tarde habrá un informe sobre eso.

source: oh, o-of course, sir!
es_419: Ah, ¡c-claro, señor!

source: anyway! start with something he can't complain about as a warm up.
es_419: ¡En fin! Entra en calor con algo de lo que no se pueda quejar.

source: w-wait! why am I relieved?!
es_419: ¡¿Cómo?! ¡¿Por qué me alivia?!

source: and you used to say you were a loner.
es_419: Ya decías que te gustaba estar solo.

source: hey, yu-eun!
es_419: ¡Ey, Yu-eun!

source: I don't want that.
es_419: Yo no quiero eso.

source: ahem…
es_419: Ejem…

source: what's wrong with me today…
es_419: ¿Qué me pasa hoy?

source: Of course, I won't.
es_419: Claro que no.

source: what should I say?
es_419: ¿Qué pongo?

source: turn!
es_419: ¡GIRA!

source: please put on some clothes first!
es_419: ¡Primero vístase, por favor!

source: I'll work for you for the rest of my life.
es_419: Trabajaré para usted el resto de mi vida.

source: you must be in high demand if you work at iren.
es_419: Si trabajas en IREN, te querrán en todas partes.

source: I think…
es_419: Creo que…

source: - episode 02 -
es_419: - episodio 02 -

source: ...to bring out his subordinate's talents and guide them to growth.
es_419: … sobre cómo aflorar el talento del personal y ayudarlo a crecer.

source: ms. gam! a present for you!
es_419: ¡Señorita Gam, un regalo para ti!

source: the governor of the bank of korea
es_419: Autoridad del banco de Corea

source: your mother sounds like...
es_419: Parece que tu madre es…

source: wow! did I get it right?!
es_419: ¡Guau! ¡¿Tenía razón?!

source: but I'll just explain it to him later.
es_419: pero se lo explicaré luego.

source: I'm sure you have your reasons...
es_419: Seguro que tienes motivos…

source: choke
es_419: se atraganta

source: like you'd know anything.
es_419: Y tú qué sabes.

source: can I get you anything, sir?
es_419: ¿Le traigo algo, señor?

source: class 1
es_419: Clase 1

source: showing social skills!
es_419: ¡Bien por la sociabilización!

source: is it because I have enough money now?
es_419: ¿Será porque ahora tengo mucho dinero?

source: …I've never seen him that excited.
es_419: … nunca lo había visto tan emocionado.

source: ultra original platinum material diamond fair shape wedding ring
es_419: ALIANZA TOTALMENTE ORIGINAL DE PLATINO Y DIAMANTE DISEÑO DELICADO

source: drizzle
es_419: FSHHH

source: why don't you work from home...
es_419: ¿Por qué no trabajas desde casa…

source: flashbacks of indecent scenes.
es_419: Recuerdos de escenas indecentes.

source: one mistake and it's over for me!
es_419: ¡Cualquier error podría ser fatal!

source: and I try to avoid drinks after work.
es_419: Y yo nunca tomo después de trabajar.

source: sale event!
es_419: ¡Ofertas!

source: I know it's disrespectful to my direct supervisor,
es_419: Sé que no quedo bien con mi superior directo,

source: ...and backtrack once in a while too.
es_419: … y también retrocedas de vez en cuando.

source: you...
es_419: Qué…

source: sure, let me check.
es_419: Seguro, le confirmo.

source: oh, well.
es_419: En fin.

source: it depends on which department you're in, but the ceo sure has a lot of problems.
es_419: Depende del departamento donde estés, pero el CEO sin dudas es muy problemático.

source: why does he have to be so good looking?!
es_419: ¡¿Por qué tenía que ser tan guapo?!

source: news!
es_419: NOTICIA!

source: it's me, your father.
es_419: Soy yo, tu padre.

source: no... let's go.
es_419: No… Vamos.

source: ...a robot.
es_419: … robot.

source: is it because of me?
es_419: ¿Es por mi culpa?

source: I saw a cafe out front.
es_419: Vi un café en frente.
